In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('abc.csv')

In [3]:
df

     name  marks       city
0   ayush    100    baglung
1  sharma    200       ohio
2    ravi   1000  kathmandu

In [5]:
df.pivot(index = "name" , columns = "city")

         marks
city   baglung kathmandu   ohio
name
ayush    100.0       NaN    NaN
ravi       NaN    1000.0    NaN
sharma     NaN       NaN  200.0